Revit 2027 API
SolidGlass.SolidglassRefractionIor Property
 The property labeled "Refraction" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SolidglassRefractionIor { get; }
Public Shared ReadOnly Property SolidglassRefractionIor As String
	Get
public:
static property String^ SolidglassRefractionIor {
	String^ get ();
}
static member SolidglassRefractionIor : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0.01, 5".
See Also
Reference
SolidGlass Class
Autodesk.Revit.DB.Visual Namespace